Autodesk.AdvanceSteel.CADAccess.FilerObject.markChanged(System.Boolean)
When bPropagate is set to true, objects related to this object will be notified about the change and will
update themselves thus bringing the necessary part of the model up to date.
This has a performance cost, so it should be rarely used.
When bPropagate is set to false, only the current object will be updated.